In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame({"key1" :["a", "a", "b","b", "a"],
                   "key2" :["one", "two", "one", "two", "one"],
                    "data1": np.random.randn(5),
                    "data2": np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -2.240545  0.710366
1    a  two -1.015065  0.264956
2    b  one -0.670560  1.204996
3    b  two  0.726051 -1.169634
4    a  one  1.684220 -0.428779

In [11]:

grouped = df["data1"].groupby(df["key1"],)

grouped
grouped.mean()

key1
a   -0.011018
b    0.785633
Name: data1, dtype: float64

In [19]:
means = df["data1"].groupby([df["key1"],df["key2"]]).mean()

means
means.unstack()

key2       one       two
key1
a    -0.009409 -0.014237
b    -0.305563  1.876828

In [20]:
sums = df["data1"].groupby([df["key1"],df["key2"]]).sum()

sums
sums.unstack()

key2       one       two
key1
a    -0.018817 -0.014237
b    -0.305563  1.876828

In [22]:
df.groupby("key1").mean()

         data1     data2
key1
a    -0.011018  0.133658
b     0.785633 -0.002550

In [23]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    one  -0.009409 -0.335479
     two  -0.014237  1.071932
b    one  -0.305563  0.264962
     two   1.876828 -0.270063

In [24]:
df.groupby(["key1", "key2"]).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [26]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.122184  0.099090
1    a  two -0.014237  1.071932
4    a  one -0.141001 -0.770048
b
  key1 key2     data1     data2
2    b  one -0.305563  0.264962
3    b  two  1.876828 -0.270063

In [33]:
  for (k1, k2), group in df.groupby(["key1", "key2"]):
        print(group.unstack())

key1   0           a
       4           a
key2   0         one
       4         one
data1  0    0.122184
       4   -0.141001
data2  0     0.09909
       4   -0.770048
dtype: object
key1   1           a
key2   1         two
data1  1   -0.014237
data2  1    1.071932
dtype: object
key1   2           b
key2   2         one
data1  2   -0.305563
data2  2    0.264962
dtype: object
key1   3           b
key2   3         two
data1  3    1.876828
data2  3   -0.270063
dtype: object